Model: "functional_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 128, 128, 3) 0                                            
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 128, 128, 3)  12          input_1[0][0]                    
__________________________________________________________________________________________________
re_lu (ReLU)                    (None, 128, 128, 3)  0           batch_normalization[0][0]        
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 128, 128, 16) 432         re_lu[0][0]                      
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 128, 128, 16) 48          input_1[0][0]                    
__________________________________________________________________________________________________
add (Add)                       (None, 128, 128, 16) 0           conv2d_1[0][0]                   
                                                                 conv2d[0][0]                     
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 128, 128, 16) 64          add[0][0]                        
__________________________________________________________________________________________________
re_lu_1 (ReLU)                  (None, 128, 128, 16) 0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 128, 128, 48) 6912        re_lu_1[0][0]                    
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 128, 128, 48) 768         add[0][0]                        
__________________________________________________________________________________________________
add_1 (Add)                     (None, 128, 128, 48) 0           conv2d_3[0][0]                   
                                                                 conv2d_2[0][0]                   
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 128, 128, 48) 192         add_1[0][0]                      
__________________________________________________________________________________________________
re_lu_2 (ReLU)                  (None, 128, 128, 48) 0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 128, 128, 48) 20736       re_lu_2[0][0]                    
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 128, 128, 48) 2304        add_1[0][0]                      
__________________________________________________________________________________________________
add_2 (Add)                     (None, 128, 128, 48) 0           conv2d_5[0][0]                   
                                                                 conv2d_4[0][0]                   
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 128, 128, 48) 192         add_2[0][0]                      
__________________________________________________________________________________________________
re_lu_3 (ReLU)                  (None, 128, 128, 48) 0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 128, 128, 48) 20736       re_lu_3[0][0]                    
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 128, 128, 48) 2304        add_2[0][0]                      
__________________________________________________________________________________________________
add_3 (Add)                     (None, 128, 128, 48) 0           conv2d_7[0][0]                   
                                                                 conv2d_6[0][0]                   
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 128, 128, 48) 192         add_3[0][0]                      
__________________________________________________________________________________________________
re_lu_4 (ReLU)                  (None, 128, 128, 48) 0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 128, 128, 48) 20736       re_lu_4[0][0]                    
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 128, 128, 48) 2304        add_3[0][0]                      
__________________________________________________________________________________________________
add_4 (Add)                     (None, 128, 128, 48) 0           conv2d_9[0][0]                   
                                                                 conv2d_8[0][0]                   
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 128, 128, 48) 192         add_4[0][0]                      
__________________________________________________________________________________________________
re_lu_5 (ReLU)                  (None, 128, 128, 48) 0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 128, 128, 48) 20736       re_lu_5[0][0]                    
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 128, 128, 48) 2304        add_4[0][0]                      
__________________________________________________________________________________________________
add_5 (Add)                     (None, 128, 128, 48) 0           conv2d_11[0][0]                  
                                                                 conv2d_10[0][0]                  
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 128, 128, 48) 192         add_5[0][0]                      
__________________________________________________________________________________________________
re_lu_6 (ReLU)                  (None, 128, 128, 48) 0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 128, 128, 48) 20736       re_lu_6[0][0]                    
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 128, 128, 48) 2304        add_5[0][0]                      
__________________________________________________________________________________________________
add_6 (Add)                     (None, 128, 128, 48) 0           conv2d_13[0][0]                  
                                                                 conv2d_12[0][0]                  
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 128, 128, 48) 192         add_6[0][0]                      
__________________________________________________________________________________________________
re_lu_7 (ReLU)                  (None, 128, 128, 48) 0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 64, 64, 96)   41472       re_lu_7[0][0]                    
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 64, 64, 96)   4608        add_6[0][0]                      
__________________________________________________________________________________________________
add_7 (Add)                     (None, 64, 64, 96)   0           conv2d_15[0][0]                  
                                                                 conv2d_14[0][0]                  
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 64, 64, 96)   384         add_7[0][0]                      
__________________________________________________________________________________________________
re_lu_8 (ReLU)                  (None, 64, 64, 96)   0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 32, 32, 96)   82944       re_lu_8[0][0]                    
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 32, 32, 96)   9216        add_7[0][0]                      
__________________________________________________________________________________________________
add_8 (Add)                     (None, 32, 32, 96)   0           conv2d_17[0][0]                  
                                                                 conv2d_16[0][0]                  
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 32, 32, 96)   384         add_8[0][0]                      
__________________________________________________________________________________________________
re_lu_9 (ReLU)                  (None, 32, 32, 96)   0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 32, 32, 96)   82944       re_lu_9[0][0]                    
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 32, 32, 96)   9216        add_8[0][0]                      
__________________________________________________________________________________________________
add_9 (Add)                     (None, 32, 32, 96)   0           conv2d_19[0][0]                  
                                                                 conv2d_18[0][0]                  
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 32, 32, 96)   384         add_9[0][0]                      
__________________________________________________________________________________________________
re_lu_10 (ReLU)                 (None, 32, 32, 96)   0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
conv2d_21 (Conv2D)              (None, 32, 32, 96)   82944       re_lu_10[0][0]                   
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, 32, 32, 96)   9216        add_9[0][0]                      
__________________________________________________________________________________________________
add_10 (Add)                    (None, 32, 32, 96)   0           conv2d_21[0][0]                  
                                                                 conv2d_20[0][0]                  
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 32, 32, 96)   384         add_10[0][0]                     
__________________________________________________________________________________________________
re_lu_11 (ReLU)                 (None, 32, 32, 96)   0           batch_normalization_11[0][0]     
__________________________________________________________________________________________________
conv2d_23 (Conv2D)              (None, 32, 32, 96)   82944       re_lu_11[0][0]                   
__________________________________________________________________________________________________
conv2d_22 (Conv2D)              (None, 32, 32, 96)   9216        add_10[0][0]                     
__________________________________________________________________________________________________
add_11 (Add)                    (None, 32, 32, 96)   0           conv2d_23[0][0]                  
                                                                 conv2d_22[0][0]                  
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 32, 32, 96)   384         add_11[0][0]                     
__________________________________________________________________________________________________
re_lu_12 (ReLU)                 (None, 32, 32, 96)   0           batch_normalization_12[0][0]     
__________________________________________________________________________________________________
conv2d_25 (Conv2D)              (None, 32, 32, 96)   82944       re_lu_12[0][0]                   
__________________________________________________________________________________________________
conv2d_24 (Conv2D)              (None, 32, 32, 96)   9216        add_11[0][0]                     
__________________________________________________________________________________________________
add_12 (Add)                    (None, 32, 32, 96)   0           conv2d_25[0][0]                  
                                                                 conv2d_24[0][0]                  
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 32, 32, 96)   384         add_12[0][0]                     
__________________________________________________________________________________________________
re_lu_13 (ReLU)                 (None, 32, 32, 96)   0           batch_normalization_13[0][0]     
__________________________________________________________________________________________________
conv2d_27 (Conv2D)              (None, 16, 16, 192)  165888      re_lu_13[0][0]                   
__________________________________________________________________________________________________
conv2d_26 (Conv2D)              (None, 16, 16, 192)  18432       add_12[0][0]                     
__________________________________________________________________________________________________
add_13 (Add)                    (None, 16, 16, 192)  0           conv2d_27[0][0]                  
                                                                 conv2d_26[0][0]                  
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, 16, 16, 192)  768         add_13[0][0]                     
__________________________________________________________________________________________________
re_lu_14 (ReLU)                 (None, 16, 16, 192)  0           batch_normalization_14[0][0]     
__________________________________________________________________________________________________
conv2d_29 (Conv2D)              (None, 8, 8, 192)    331776      re_lu_14[0][0]                   
__________________________________________________________________________________________________
conv2d_28 (Conv2D)              (None, 8, 8, 192)    36864       add_13[0][0]                     
__________________________________________________________________________________________________
add_14 (Add)                    (None, 8, 8, 192)    0           conv2d_29[0][0]                  
                                                                 conv2d_28[0][0]                  
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, 8, 8, 192)    768         add_14[0][0]                     
__________________________________________________________________________________________________
re_lu_15 (ReLU)                 (None, 8, 8, 192)    0           batch_normalization_15[0][0]     
__________________________________________________________________________________________________
conv2d_31 (Conv2D)              (None, 8, 8, 192)    331776      re_lu_15[0][0]                   
__________________________________________________________________________________________________
conv2d_30 (Conv2D)              (None, 8, 8, 192)    36864       add_14[0][0]                     
__________________________________________________________________________________________________
add_15 (Add)                    (None, 8, 8, 192)    0           conv2d_31[0][0]                  
                                                                 conv2d_30[0][0]                  
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (None, 8, 8, 192)    768         add_15[0][0]                     
__________________________________________________________________________________________________
re_lu_16 (ReLU)                 (None, 8, 8, 192)    0           batch_normalization_16[0][0]     
__________________________________________________________________________________________________
conv2d_33 (Conv2D)              (None, 8, 8, 192)    331776      re_lu_16[0][0]                   
__________________________________________________________________________________________________
conv2d_32 (Conv2D)              (None, 8, 8, 192)    36864       add_15[0][0]                     
__________________________________________________________________________________________________
add_16 (Add)                    (None, 8, 8, 192)    0           conv2d_33[0][0]                  
                                                                 conv2d_32[0][0]                  
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (None, 8, 8, 192)    768         add_16[0][0]                     
__________________________________________________________________________________________________
re_lu_17 (ReLU)                 (None, 8, 8, 192)    0           batch_normalization_17[0][0]     
__________________________________________________________________________________________________
conv2d_35 (Conv2D)              (None, 8, 8, 192)    331776      re_lu_17[0][0]                   
__________________________________________________________________________________________________
conv2d_34 (Conv2D)              (None, 8, 8, 192)    36864       add_16[0][0]                     
__________________________________________________________________________________________________
add_17 (Add)                    (None, 8, 8, 192)    0           conv2d_35[0][0]                  
                                                                 conv2d_34[0][0]                  
__________________________________________________________________________________________________
batch_normalization_18 (BatchNo (None, 8, 8, 192)    768         add_17[0][0]                     
__________________________________________________________________________________________________
re_lu_18 (ReLU)                 (None, 8, 8, 192)    0           batch_normalization_18[0][0]     
__________________________________________________________________________________________________
conv2d_37 (Conv2D)              (None, 8, 8, 192)    331776      re_lu_18[0][0]                   
__________________________________________________________________________________________________
conv2d_36 (Conv2D)              (None, 8, 8, 192)    36864       add_17[0][0]                     
__________________________________________________________________________________________________
add_18 (Add)                    (None, 8, 8, 192)    0           conv2d_37[0][0]                  
                                                                 conv2d_36[0][0]                  
__________________________________________________________________________________________________
global_average_pooling2d (Globa (None, 192)          0           add_18[0][0]                     
__________________________________________________________________________________________________
dense (Dense)                   (None, 2)            386         global_average_pooling2d[0][0]   
__________________________________________________________________________________________________
activation (Activation)         (None, 2)            0           dense[0][0]                      
==================================================================================================
Total params: 2,665,518
Trainable params: 2,661,832
Non-trainable params: 3,686
__________________________________________________________________________________________________