Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 224, 224, 3) 0                                            
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 224, 224, 3)  12          input_1[0][0]                    
__________________________________________________________________________________________________
re_lu (ReLU)                    (None, 224, 224, 3)  0           batch_normalization[0][0]        
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 224, 224, 16) 432         re_lu[0][0]                      
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 224, 224, 16) 48          input_1[0][0]                    
__________________________________________________________________________________________________
add (Add)                       (None, 224, 224, 16) 0           conv2d_1[0][0]                   
                                                                 conv2d[0][0]                     
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 224, 224, 16) 64          add[0][0]                        
__________________________________________________________________________________________________
re_lu_1 (ReLU)                  (None, 224, 224, 16) 0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 224, 224, 32) 4608        re_lu_1[0][0]                    
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 224, 224, 32) 512         add[0][0]                        
__________________________________________________________________________________________________
add_1 (Add)                     (None, 224, 224, 32) 0           conv2d_3[0][0]                   
                                                                 conv2d_2[0][0]                   
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 224, 224, 32) 128         add_1[0][0]                      
__________________________________________________________________________________________________
re_lu_2 (ReLU)                  (None, 224, 224, 32) 0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 224, 224, 32) 9216        re_lu_2[0][0]                    
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 224, 224, 32) 1024        add_1[0][0]                      
__________________________________________________________________________________________________
add_2 (Add)                     (None, 224, 224, 32) 0           conv2d_5[0][0]                   
                                                                 conv2d_4[0][0]                   
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 224, 224, 32) 128         add_2[0][0]                      
__________________________________________________________________________________________________
re_lu_3 (ReLU)                  (None, 224, 224, 32) 0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 224, 224, 32) 9216        re_lu_3[0][0]                    
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 224, 224, 32) 1024        add_2[0][0]                      
__________________________________________________________________________________________________
add_3 (Add)                     (None, 224, 224, 32) 0           conv2d_7[0][0]                   
                                                                 conv2d_6[0][0]                   
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 224, 224, 32) 128         add_3[0][0]                      
__________________________________________________________________________________________________
re_lu_4 (ReLU)                  (None, 224, 224, 32) 0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 224, 224, 32) 9216        re_lu_4[0][0]                    
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 224, 224, 32) 1024        add_3[0][0]                      
__________________________________________________________________________________________________
add_4 (Add)                     (None, 224, 224, 32) 0           conv2d_9[0][0]                   
                                                                 conv2d_8[0][0]                   
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 224, 224, 32) 128         add_4[0][0]                      
__________________________________________________________________________________________________
re_lu_5 (ReLU)                  (None, 224, 224, 32) 0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 112, 112, 64) 18432       re_lu_5[0][0]                    
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 112, 112, 64) 2048        add_4[0][0]                      
__________________________________________________________________________________________________
add_5 (Add)                     (None, 112, 112, 64) 0           conv2d_11[0][0]                  
                                                                 conv2d_10[0][0]                  
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 112, 112, 64) 256         add_5[0][0]                      
__________________________________________________________________________________________________
re_lu_6 (ReLU)                  (None, 112, 112, 64) 0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 56, 56, 64)   36864       re_lu_6[0][0]                    
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 56, 56, 64)   4096        add_5[0][0]                      
__________________________________________________________________________________________________
add_6 (Add)                     (None, 56, 56, 64)   0           conv2d_13[0][0]                  
                                                                 conv2d_12[0][0]                  
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 56, 56, 64)   256         add_6[0][0]                      
__________________________________________________________________________________________________
re_lu_7 (ReLU)                  (None, 56, 56, 64)   0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 56, 56, 64)   36864       re_lu_7[0][0]                    
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 56, 56, 64)   4096        add_6[0][0]                      
__________________________________________________________________________________________________
add_7 (Add)                     (None, 56, 56, 64)   0           conv2d_15[0][0]                  
                                                                 conv2d_14[0][0]                  
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 56, 56, 64)   256         add_7[0][0]                      
__________________________________________________________________________________________________
re_lu_8 (ReLU)                  (None, 56, 56, 64)   0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 56, 56, 64)   36864       re_lu_8[0][0]                    
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 56, 56, 64)   4096        add_7[0][0]                      
__________________________________________________________________________________________________
add_8 (Add)                     (None, 56, 56, 64)   0           conv2d_17[0][0]                  
                                                                 conv2d_16[0][0]                  
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 56, 56, 64)   256         add_8[0][0]                      
__________________________________________________________________________________________________
re_lu_9 (ReLU)                  (None, 56, 56, 64)   0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 28, 28, 128)  73728       re_lu_9[0][0]                    
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 28, 28, 128)  8192        add_8[0][0]                      
__________________________________________________________________________________________________
add_9 (Add)                     (None, 28, 28, 128)  0           conv2d_19[0][0]                  
                                                                 conv2d_18[0][0]                  
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 28, 28, 128)  512         add_9[0][0]                      
__________________________________________________________________________________________________
re_lu_10 (ReLU)                 (None, 28, 28, 128)  0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
conv2d_21 (Conv2D)              (None, 14, 14, 128)  147456      re_lu_10[0][0]                   
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, 14, 14, 128)  16384       add_9[0][0]                      
__________________________________________________________________________________________________
add_10 (Add)                    (None, 14, 14, 128)  0           conv2d_21[0][0]                  
                                                                 conv2d_20[0][0]                  
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 14, 14, 128)  512         add_10[0][0]                     
__________________________________________________________________________________________________
re_lu_11 (ReLU)                 (None, 14, 14, 128)  0           batch_normalization_11[0][0]     
__________________________________________________________________________________________________
conv2d_23 (Conv2D)              (None, 14, 14, 128)  147456      re_lu_11[0][0]                   
__________________________________________________________________________________________________
conv2d_22 (Conv2D)              (None, 14, 14, 128)  16384       add_10[0][0]                     
__________________________________________________________________________________________________
add_11 (Add)                    (None, 14, 14, 128)  0           conv2d_23[0][0]                  
                                                                 conv2d_22[0][0]                  
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 14, 14, 128)  512         add_11[0][0]                     
__________________________________________________________________________________________________
re_lu_12 (ReLU)                 (None, 14, 14, 128)  0           batch_normalization_12[0][0]     
__________________________________________________________________________________________________
conv2d_25 (Conv2D)              (None, 14, 14, 128)  147456      re_lu_12[0][0]                   
__________________________________________________________________________________________________
conv2d_24 (Conv2D)              (None, 14, 14, 128)  16384       add_11[0][0]                     
__________________________________________________________________________________________________
add_12 (Add)                    (None, 14, 14, 128)  0           conv2d_25[0][0]                  
                                                                 conv2d_24[0][0]                  
__________________________________________________________________________________________________
global_average_pooling2d (Globa (None, 128)          0           add_12[0][0]                     
__________________________________________________________________________________________________
dense (Dense)                   (None, 2)            258         global_average_pooling2d[0][0]   
__________________________________________________________________________________________________
activation (Activation)         (None, 2)            0           dense[0][0]                      
==================================================================================================
Total params: 756,526
Trainable params: 754,952
Non-trainable params: 1,574
__________________________________________________________________________________________________