Model: "functional_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 224, 224, 3) 0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 224, 224, 16) 432         input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 224, 224, 16) 64          conv2d[0][0]                     
__________________________________________________________________________________________________
re_lu (ReLU)                    (None, 224, 224, 16) 0           batch_normalization[0][0]        
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 224, 224, 16) 64          re_lu[0][0]                      
__________________________________________________________________________________________________
re_lu_1 (ReLU)                  (None, 224, 224, 16) 0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 224, 224, 16) 256         re_lu_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 224, 224, 16) 64          conv2d_2[0][0]                   
__________________________________________________________________________________________________
re_lu_2 (ReLU)                  (None, 224, 224, 16) 0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 224, 224, 16) 2304        re_lu_2[0][0]                    
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 224, 224, 16) 64          conv2d_3[0][0]                   
__________________________________________________________________________________________________
re_lu_3 (ReLU)                  (None, 224, 224, 16) 0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 224, 224, 64) 1024        re_lu[0][0]                      
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 224, 224, 64) 1024        re_lu_3[0][0]                    
__________________________________________________________________________________________________
add (Add)                       (None, 224, 224, 64) 0           conv2d_1[0][0]                   
                                                                 conv2d_4[0][0]                   
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 224, 224, 64) 256         add[0][0]                        
__________________________________________________________________________________________________
re_lu_4 (ReLU)                  (None, 224, 224, 64) 0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 224, 224, 16) 1024        re_lu_4[0][0]                    
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 224, 224, 16) 64          conv2d_5[0][0]                   
__________________________________________________________________________________________________
re_lu_5 (ReLU)                  (None, 224, 224, 16) 0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 224, 224, 16) 2304        re_lu_5[0][0]                    
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 224, 224, 16) 64          conv2d_6[0][0]                   
__________________________________________________________________________________________________
re_lu_6 (ReLU)                  (None, 224, 224, 16) 0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 224, 224, 64) 1024        re_lu_6[0][0]                    
__________________________________________________________________________________________________
add_1 (Add)                     (None, 224, 224, 64) 0           conv2d_7[0][0]                   
                                                                 add[0][0]                        
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 224, 224, 64) 256         add_1[0][0]                      
__________________________________________________________________________________________________
re_lu_7 (ReLU)                  (None, 224, 224, 64) 0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 224, 224, 16) 1024        re_lu_7[0][0]                    
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 224, 224, 16) 64          conv2d_8[0][0]                   
__________________________________________________________________________________________________
re_lu_8 (ReLU)                  (None, 224, 224, 16) 0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 224, 224, 16) 2304        re_lu_8[0][0]                    
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 224, 224, 16) 64          conv2d_9[0][0]                   
__________________________________________________________________________________________________
re_lu_9 (ReLU)                  (None, 224, 224, 16) 0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 224, 224, 64) 1024        re_lu_9[0][0]                    
__________________________________________________________________________________________________
add_2 (Add)                     (None, 224, 224, 64) 0           conv2d_10[0][0]                  
                                                                 add_1[0][0]                      
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 224, 224, 64) 256         add_2[0][0]                      
__________________________________________________________________________________________________
re_lu_10 (ReLU)                 (None, 224, 224, 64) 0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 224, 224, 16) 1024        re_lu_10[0][0]                   
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 224, 224, 16) 64          conv2d_11[0][0]                  
__________________________________________________________________________________________________
re_lu_11 (ReLU)                 (None, 224, 224, 16) 0           batch_normalization_11[0][0]     
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 224, 224, 16) 2304        re_lu_11[0][0]                   
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 224, 224, 16) 64          conv2d_12[0][0]                  
__________________________________________________________________________________________________
re_lu_12 (ReLU)                 (None, 224, 224, 16) 0           batch_normalization_12[0][0]     
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 224, 224, 64) 1024        re_lu_12[0][0]                   
__________________________________________________________________________________________________
add_3 (Add)                     (None, 224, 224, 64) 0           conv2d_13[0][0]                  
                                                                 add_2[0][0]                      
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 224, 224, 64) 256         add_3[0][0]                      
__________________________________________________________________________________________________
re_lu_13 (ReLU)                 (None, 224, 224, 64) 0           batch_normalization_13[0][0]     
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 224, 224, 16) 1024        re_lu_13[0][0]                   
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, 224, 224, 16) 64          conv2d_14[0][0]                  
__________________________________________________________________________________________________
re_lu_14 (ReLU)                 (None, 224, 224, 16) 0           batch_normalization_14[0][0]     
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 224, 224, 16) 2304        re_lu_14[0][0]                   
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, 224, 224, 16) 64          conv2d_15[0][0]                  
__________________________________________________________________________________________________
re_lu_15 (ReLU)                 (None, 224, 224, 16) 0           batch_normalization_15[0][0]     
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 224, 224, 64) 1024        re_lu_15[0][0]                   
__________________________________________________________________________________________________
add_4 (Add)                     (None, 224, 224, 64) 0           conv2d_16[0][0]                  
                                                                 add_3[0][0]                      
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (None, 224, 224, 64) 256         add_4[0][0]                      
__________________________________________________________________________________________________
re_lu_16 (ReLU)                 (None, 224, 224, 64) 0           batch_normalization_16[0][0]     
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (None, 224, 224, 64) 256         re_lu_16[0][0]                   
__________________________________________________________________________________________________
re_lu_17 (ReLU)                 (None, 224, 224, 64) 0           batch_normalization_17[0][0]     
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 112, 112, 32) 2048        re_lu_17[0][0]                   
__________________________________________________________________________________________________
batch_normalization_18 (BatchNo (None, 112, 112, 32) 128         conv2d_18[0][0]                  
__________________________________________________________________________________________________
re_lu_18 (ReLU)                 (None, 112, 112, 32) 0           batch_normalization_18[0][0]     
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 112, 112, 32) 9216        re_lu_18[0][0]                   
__________________________________________________________________________________________________
batch_normalization_19 (BatchNo (None, 112, 112, 32) 128         conv2d_19[0][0]                  
__________________________________________________________________________________________________
re_lu_19 (ReLU)                 (None, 112, 112, 32) 0           batch_normalization_19[0][0]     
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 112, 112, 128 8192        re_lu_16[0][0]                   
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, 112, 112, 128 4096        re_lu_19[0][0]                   
__________________________________________________________________________________________________
add_5 (Add)                     (None, 112, 112, 128 0           conv2d_17[0][0]                  
                                                                 conv2d_20[0][0]                  
__________________________________________________________________________________________________
batch_normalization_20 (BatchNo (None, 112, 112, 128 512         add_5[0][0]                      
__________________________________________________________________________________________________
re_lu_20 (ReLU)                 (None, 112, 112, 128 0           batch_normalization_20[0][0]     
__________________________________________________________________________________________________
conv2d_21 (Conv2D)              (None, 112, 112, 32) 4096        re_lu_20[0][0]                   
__________________________________________________________________________________________________
batch_normalization_21 (BatchNo (None, 112, 112, 32) 128         conv2d_21[0][0]                  
__________________________________________________________________________________________________
re_lu_21 (ReLU)                 (None, 112, 112, 32) 0           batch_normalization_21[0][0]     
__________________________________________________________________________________________________
conv2d_22 (Conv2D)              (None, 112, 112, 32) 9216        re_lu_21[0][0]                   
__________________________________________________________________________________________________
batch_normalization_22 (BatchNo (None, 112, 112, 32) 128         conv2d_22[0][0]                  
__________________________________________________________________________________________________
re_lu_22 (ReLU)                 (None, 112, 112, 32) 0           batch_normalization_22[0][0]     
__________________________________________________________________________________________________
conv2d_23 (Conv2D)              (None, 112, 112, 128 4096        re_lu_22[0][0]                   
__________________________________________________________________________________________________
add_6 (Add)                     (None, 112, 112, 128 0           conv2d_23[0][0]                  
                                                                 add_5[0][0]                      
__________________________________________________________________________________________________
batch_normalization_23 (BatchNo (None, 112, 112, 128 512         add_6[0][0]                      
__________________________________________________________________________________________________
re_lu_23 (ReLU)                 (None, 112, 112, 128 0           batch_normalization_23[0][0]     
__________________________________________________________________________________________________
conv2d_24 (Conv2D)              (None, 112, 112, 32) 4096        re_lu_23[0][0]                   
__________________________________________________________________________________________________
batch_normalization_24 (BatchNo (None, 112, 112, 32) 128         conv2d_24[0][0]                  
__________________________________________________________________________________________________
re_lu_24 (ReLU)                 (None, 112, 112, 32) 0           batch_normalization_24[0][0]     
__________________________________________________________________________________________________
conv2d_25 (Conv2D)              (None, 112, 112, 32) 9216        re_lu_24[0][0]                   
__________________________________________________________________________________________________
batch_normalization_25 (BatchNo (None, 112, 112, 32) 128         conv2d_25[0][0]                  
__________________________________________________________________________________________________
re_lu_25 (ReLU)                 (None, 112, 112, 32) 0           batch_normalization_25[0][0]     
__________________________________________________________________________________________________
conv2d_26 (Conv2D)              (None, 112, 112, 128 4096        re_lu_25[0][0]                   
__________________________________________________________________________________________________
add_7 (Add)                     (None, 112, 112, 128 0           conv2d_26[0][0]                  
                                                                 add_6[0][0]                      
__________________________________________________________________________________________________
batch_normalization_26 (BatchNo (None, 112, 112, 128 512         add_7[0][0]                      
__________________________________________________________________________________________________
re_lu_26 (ReLU)                 (None, 112, 112, 128 0           batch_normalization_26[0][0]     
__________________________________________________________________________________________________
conv2d_27 (Conv2D)              (None, 112, 112, 32) 4096        re_lu_26[0][0]                   
__________________________________________________________________________________________________
batch_normalization_27 (BatchNo (None, 112, 112, 32) 128         conv2d_27[0][0]                  
__________________________________________________________________________________________________
re_lu_27 (ReLU)                 (None, 112, 112, 32) 0           batch_normalization_27[0][0]     
__________________________________________________________________________________________________
conv2d_28 (Conv2D)              (None, 112, 112, 32) 9216        re_lu_27[0][0]                   
__________________________________________________________________________________________________
batch_normalization_28 (BatchNo (None, 112, 112, 32) 128         conv2d_28[0][0]                  
__________________________________________________________________________________________________
re_lu_28 (ReLU)                 (None, 112, 112, 32) 0           batch_normalization_28[0][0]     
__________________________________________________________________________________________________
conv2d_29 (Conv2D)              (None, 112, 112, 128 4096        re_lu_28[0][0]                   
__________________________________________________________________________________________________
add_8 (Add)                     (None, 112, 112, 128 0           conv2d_29[0][0]                  
                                                                 add_7[0][0]                      
__________________________________________________________________________________________________
batch_normalization_29 (BatchNo (None, 112, 112, 128 512         add_8[0][0]                      
__________________________________________________________________________________________________
re_lu_29 (ReLU)                 (None, 112, 112, 128 0           batch_normalization_29[0][0]     
__________________________________________________________________________________________________
conv2d_30 (Conv2D)              (None, 112, 112, 32) 4096        re_lu_29[0][0]                   
__________________________________________________________________________________________________
batch_normalization_30 (BatchNo (None, 112, 112, 32) 128         conv2d_30[0][0]                  
__________________________________________________________________________________________________
re_lu_30 (ReLU)                 (None, 112, 112, 32) 0           batch_normalization_30[0][0]     
__________________________________________________________________________________________________
conv2d_31 (Conv2D)              (None, 112, 112, 32) 9216        re_lu_30[0][0]                   
__________________________________________________________________________________________________
batch_normalization_31 (BatchNo (None, 112, 112, 32) 128         conv2d_31[0][0]                  
__________________________________________________________________________________________________
re_lu_31 (ReLU)                 (None, 112, 112, 32) 0           batch_normalization_31[0][0]     
__________________________________________________________________________________________________
conv2d_32 (Conv2D)              (None, 112, 112, 128 4096        re_lu_31[0][0]                   
__________________________________________________________________________________________________
add_9 (Add)                     (None, 112, 112, 128 0           conv2d_32[0][0]                  
                                                                 add_8[0][0]                      
__________________________________________________________________________________________________
batch_normalization_32 (BatchNo (None, 112, 112, 128 512         add_9[0][0]                      
__________________________________________________________________________________________________
re_lu_32 (ReLU)                 (None, 112, 112, 128 0           batch_normalization_32[0][0]     
__________________________________________________________________________________________________
batch_normalization_33 (BatchNo (None, 112, 112, 128 512         re_lu_32[0][0]                   
__________________________________________________________________________________________________
re_lu_33 (ReLU)                 (None, 112, 112, 128 0           batch_normalization_33[0][0]     
__________________________________________________________________________________________________
conv2d_34 (Conv2D)              (None, 56, 56, 64)   8192        re_lu_33[0][0]                   
__________________________________________________________________________________________________
batch_normalization_34 (BatchNo (None, 56, 56, 64)   256         conv2d_34[0][0]                  
__________________________________________________________________________________________________
re_lu_34 (ReLU)                 (None, 56, 56, 64)   0           batch_normalization_34[0][0]     
__________________________________________________________________________________________________
conv2d_35 (Conv2D)              (None, 56, 56, 64)   36864       re_lu_34[0][0]                   
__________________________________________________________________________________________________
batch_normalization_35 (BatchNo (None, 56, 56, 64)   256         conv2d_35[0][0]                  
__________________________________________________________________________________________________
re_lu_35 (ReLU)                 (None, 56, 56, 64)   0           batch_normalization_35[0][0]     
__________________________________________________________________________________________________
conv2d_33 (Conv2D)              (None, 56, 56, 256)  32768       re_lu_32[0][0]                   
__________________________________________________________________________________________________
conv2d_36 (Conv2D)              (None, 56, 56, 256)  16384       re_lu_35[0][0]                   
__________________________________________________________________________________________________
add_10 (Add)                    (None, 56, 56, 256)  0           conv2d_33[0][0]                  
                                                                 conv2d_36[0][0]                  
__________________________________________________________________________________________________
batch_normalization_36 (BatchNo (None, 56, 56, 256)  1024        add_10[0][0]                     
__________________________________________________________________________________________________
re_lu_36 (ReLU)                 (None, 56, 56, 256)  0           batch_normalization_36[0][0]     
__________________________________________________________________________________________________
conv2d_37 (Conv2D)              (None, 56, 56, 64)   16384       re_lu_36[0][0]                   
__________________________________________________________________________________________________
batch_normalization_37 (BatchNo (None, 56, 56, 64)   256         conv2d_37[0][0]                  
__________________________________________________________________________________________________
re_lu_37 (ReLU)                 (None, 56, 56, 64)   0           batch_normalization_37[0][0]     
__________________________________________________________________________________________________
conv2d_38 (Conv2D)              (None, 56, 56, 64)   36864       re_lu_37[0][0]                   
__________________________________________________________________________________________________
batch_normalization_38 (BatchNo (None, 56, 56, 64)   256         conv2d_38[0][0]                  
__________________________________________________________________________________________________
re_lu_38 (ReLU)                 (None, 56, 56, 64)   0           batch_normalization_38[0][0]     
__________________________________________________________________________________________________
conv2d_39 (Conv2D)              (None, 56, 56, 256)  16384       re_lu_38[0][0]                   
__________________________________________________________________________________________________
add_11 (Add)                    (None, 56, 56, 256)  0           conv2d_39[0][0]                  
                                                                 add_10[0][0]                     
__________________________________________________________________________________________________
batch_normalization_39 (BatchNo (None, 56, 56, 256)  1024        add_11[0][0]                     
__________________________________________________________________________________________________
re_lu_39 (ReLU)                 (None, 56, 56, 256)  0           batch_normalization_39[0][0]     
__________________________________________________________________________________________________
conv2d_40 (Conv2D)              (None, 56, 56, 64)   16384       re_lu_39[0][0]                   
__________________________________________________________________________________________________
batch_normalization_40 (BatchNo (None, 56, 56, 64)   256         conv2d_40[0][0]                  
__________________________________________________________________________________________________
re_lu_40 (ReLU)                 (None, 56, 56, 64)   0           batch_normalization_40[0][0]     
__________________________________________________________________________________________________
conv2d_41 (Conv2D)              (None, 56, 56, 64)   36864       re_lu_40[0][0]                   
__________________________________________________________________________________________________
batch_normalization_41 (BatchNo (None, 56, 56, 64)   256         conv2d_41[0][0]                  
__________________________________________________________________________________________________
re_lu_41 (ReLU)                 (None, 56, 56, 64)   0           batch_normalization_41[0][0]     
__________________________________________________________________________________________________
conv2d_42 (Conv2D)              (None, 56, 56, 256)  16384       re_lu_41[0][0]                   
__________________________________________________________________________________________________
add_12 (Add)                    (None, 56, 56, 256)  0           conv2d_42[0][0]                  
                                                                 add_11[0][0]                     
__________________________________________________________________________________________________
batch_normalization_42 (BatchNo (None, 56, 56, 256)  1024        add_12[0][0]                     
__________________________________________________________________________________________________
re_lu_42 (ReLU)                 (None, 56, 56, 256)  0           batch_normalization_42[0][0]     
__________________________________________________________________________________________________
conv2d_43 (Conv2D)              (None, 56, 56, 64)   16384       re_lu_42[0][0]                   
__________________________________________________________________________________________________
batch_normalization_43 (BatchNo (None, 56, 56, 64)   256         conv2d_43[0][0]                  
__________________________________________________________________________________________________
re_lu_43 (ReLU)                 (None, 56, 56, 64)   0           batch_normalization_43[0][0]     
__________________________________________________________________________________________________
conv2d_44 (Conv2D)              (None, 56, 56, 64)   36864       re_lu_43[0][0]                   
__________________________________________________________________________________________________
batch_normalization_44 (BatchNo (None, 56, 56, 64)   256         conv2d_44[0][0]                  
__________________________________________________________________________________________________
re_lu_44 (ReLU)                 (None, 56, 56, 64)   0           batch_normalization_44[0][0]     
__________________________________________________________________________________________________
conv2d_45 (Conv2D)              (None, 56, 56, 256)  16384       re_lu_44[0][0]                   
__________________________________________________________________________________________________
add_13 (Add)                    (None, 56, 56, 256)  0           conv2d_45[0][0]                  
                                                                 add_12[0][0]                     
__________________________________________________________________________________________________
batch_normalization_45 (BatchNo (None, 56, 56, 256)  1024        add_13[0][0]                     
__________________________________________________________________________________________________
re_lu_45 (ReLU)                 (None, 56, 56, 256)  0           batch_normalization_45[0][0]     
__________________________________________________________________________________________________
conv2d_46 (Conv2D)              (None, 56, 56, 64)   16384       re_lu_45[0][0]                   
__________________________________________________________________________________________________
batch_normalization_46 (BatchNo (None, 56, 56, 64)   256         conv2d_46[0][0]                  
__________________________________________________________________________________________________
re_lu_46 (ReLU)                 (None, 56, 56, 64)   0           batch_normalization_46[0][0]     
__________________________________________________________________________________________________
conv2d_47 (Conv2D)              (None, 56, 56, 64)   36864       re_lu_46[0][0]                   
__________________________________________________________________________________________________
batch_normalization_47 (BatchNo (None, 56, 56, 64)   256         conv2d_47[0][0]                  
__________________________________________________________________________________________________
re_lu_47 (ReLU)                 (None, 56, 56, 64)   0           batch_normalization_47[0][0]     
__________________________________________________________________________________________________
conv2d_48 (Conv2D)              (None, 56, 56, 256)  16384       re_lu_47[0][0]                   
__________________________________________________________________________________________________
add_14 (Add)                    (None, 56, 56, 256)  0           conv2d_48[0][0]                  
                                                                 add_13[0][0]                     
__________________________________________________________________________________________________
batch_normalization_48 (BatchNo (None, 56, 56, 256)  1024        add_14[0][0]                     
__________________________________________________________________________________________________
re_lu_48 (ReLU)                 (None, 56, 56, 256)  0           batch_normalization_48[0][0]     
__________________________________________________________________________________________________
global_average_pooling2d (Globa (None, 256)          0           re_lu_48[0][0]                   
__________________________________________________________________________________________________
dense (Dense)                   (None, 2)            514         global_average_pooling2d[0][0]   
__________________________________________________________________________________________________
activation (Activation)         (None, 2)            0           dense[0][0]                      
==================================================================================================
Total params: 503,218
Trainable params: 496,050
Non-trainable params: 7,168
__________________________________________________________________________________________________